#Generated by Fabric Compiler ( version 2022.1 <build 99559> ) at Fri Feb 21 18:11:13 2025

add_design "H:/PANGO_EDA/my_project/first_try/led.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
add_constraint "H:/PANGO_EDA/my_project/first_try/first_try.lcf"
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
gen_netlist 
remove_design -verilog "H:/PANGO_EDA/my_project/first_try/led.v"
remove_constraint -force -logic -lcf "H:/PANGO_EDA/my_project/first_try/first_try.lcf"
add_design "H:/PANGO_EDA/my_project/Briey100.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module Briey
remove_design -force -verilog "H:/PANGO_EDA/my_project/Briey100.v"
add_design "H:/PANGO_EDA/my_project/usebirey.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module Briey
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module Briey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
add_constraint "H:/PANGO_EDA/my_project/first_try/first_try.lcf"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module Briey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_design -verilog "H:/PANGO_EDA/my_project/usebirey.v"
add_design "H:/PANGO_EDA/my_project/Briey_os_full.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module Briey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
remove_constraint  -logic -lcf "H:/PANGO_EDA/my_project/first_try/first_try.lcf"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module Briey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
remove_design -verilog "H:/PANGO_EDA/my_project/Briey_os_full.v"
add_design "H:/PANGO_EDA/my_project/usebirey.v"
add_constraint "H:/PANGO_EDA/my_project/first_try/first_try.lcf"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module Briey
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module Briey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_design -verilog "H:/PANGO_EDA/my_project/usebirey.v"
add_design "H:/PANGO_EDA/my_project/top.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module VexRiscv
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
remove_design -verilog "H:/PANGO_EDA/my_project/top.v"
add_design "H:/PANGO_EDA/my_project/Briey.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module Briey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module Briey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_design -verilog "H:/PANGO_EDA/my_project/Briey.v"
add_design "H:/PANGO_EDA/my_project/top.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_design -verilog "H:/PANGO_EDA/my_project/top.v"
add_design "H:/PANGO_EDA/my_project/Briey.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module Briey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module Briey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module Briey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design "H:/git_my/gowin-VexRiscV/briey_cpu_core/first_try/Briey.v"
add_design H:/git_my/gowin-VexRiscV/briey_cpu_core/first_try/ipcore/adf/adf.idf
